In [6]:
import sqlite3
db = sqlite3.connect("my_file.db")

In [7]:
cursor = db.cursor()

In [ ]:
cursor.execute("CREATE TABLE score1(gender TEXT, student_id INT PRIMARY KEY, marks INT)")

In [8]:
results = cursor.execute("SELECT * FROM score1")
for row in results:
    print(row)

('Male', 100, 55)
('Female', 101, 60)
('Female', 102, 68)
('Female', 103, 60)
('Female', 85, 96)
('Female', 105, 14)
('Male', 106, 25)
('Male', 107, 36)
('Male', 108, 69)
('Male', 109, 58)
('Male', 110, 47)
('Female', 111, 74)
('Female', 112, 85)
('Female', 113, 96)
('Female', 114, 41)
('Female', 115, 52)
('Female', 116, 63)
('Female', 117, 37)
('Female', 118, 38)
('Male', 119, 29)
('Male', 120, 96)
('Female', 121, 78)

In [11]:
#WHERE CLAUSE 
sql = "SELECT * FROM score1 WHERE student_id = 105"
result = cursor.execute(sql)
for row in result:
    print(row)

('Female', 105, 14)

In [12]:
results = cursor.execute("SELECT * FROM score1")
for row in results:
    print(row)

('Male', 100, 55)
('Female', 101, 60)
('Female', 102, 68)
('Female', 103, 60)
('Female', 85, 96)
('Female', 105, 14)
('Male', 106, 25)
('Male', 107, 36)
('Male', 108, 69)
('Male', 109, 58)
('Male', 110, 47)
('Female', 111, 74)
('Female', 112, 85)
('Female', 113, 96)
('Female', 114, 41)
('Female', 115, 52)
('Female', 116, 63)
('Female', 117, 37)
('Female', 118, 38)
('Male', 119, 29)
('Male', 120, 96)
('Female', 121, 78)

In [13]:
# WHERE CLAUSE
sql = "SELECT * FROM score1 WHERE student_id = 85"
results = cursor.execute(sql)
for row in result:
    print(row)

('Female', 85, 96)

In [14]:
#DELETE RECORDS
sql = "DELETE FROM score1 WHERE student_id = 85"
db.commit()
cursor.execute(sql)

In [15]:
results = cursor.execute("SELECT * FROM score1")
for row in results:
    print(row)

('Male', 100, 55)
('Female', 101, 60)
('Female', 102, 68)
('Female', 103, 60)
('Female', 105, 14)
('Male', 106, 25)
('Male', 107, 36)
('Male', 108, 69)
('Male', 109, 58)
('Male', 110, 47)
('Female', 111, 74)
('Female', 112, 85)
('Female', 113, 96)
('Female', 114, 41)
('Female', 115, 52)
('Female', 116, 63)
('Female', 117, 37)
('Female', 118, 38)
('Male', 119, 29)
('Male', 120, 96)
('Female', 121, 78)

In [16]:
#ORDER BY
result = cursor.execute("SELECT*FROM score1 ORDER BY marks desc")
for row in result:
    print(row)

('Female', 113, 96)
('Male', 120, 96)
('Female', 112, 85)
('Female', 121, 78)
('Female', 111, 74)
('Male', 108, 69)
('Female', 102, 68)
('Female', 116, 63)
('Female', 101, 60)
('Female', 103, 60)
('Male', 109, 58)
('Male', 100, 55)
('Female', 115, 52)
('Male', 110, 47)
('Female', 114, 41)
('Female', 118, 38)
('Female', 117, 37)
('Male', 107, 36)
('Male', 119, 29)
('Male', 106, 25)
('Female', 105, 14)

In [17]:
#update
sql = "UPDATE score1 SET marks = 50 WHERE student_id = 107"
cursor.execute(sql)

In [18]:
sql = "SELECT * FROM score1 WHERE student_id = 107"
results = cursor.execute(sql)
for row in result:
    print(row)

('Male', 107, 50)

In [19]:
#MULTIPLE UPDATE USING "IN"
sql = "UPDATE score1 SET marks = 35 WHERE student_id IN (107,119)"
cursor.execute(sql)

In [20]:
results = cursor.execute("SELECT * FROM score1")
for row in results:
    print(row)

('Male', 100, 55)
('Female', 101, 60)
('Female', 102, 68)
('Female', 103, 60)
('Female', 105, 14)
('Male', 106, 25)
('Male', 107, 35)
('Male', 108, 69)
('Male', 109, 58)
('Male', 110, 47)
('Female', 111, 74)
('Female', 112, 85)
('Female', 113, 96)
('Female', 114, 41)
('Female', 115, 52)
('Female', 116, 63)
('Female', 117, 37)
('Female', 118, 38)
('Male', 119, 35)
('Male', 120, 96)
('Female', 121, 78)

In [21]:
#update records using BETWEEN 
sql = "UPDATE score1 SET marks = 66 WHERE student_id between 107 and 119"
cursor.execute(sql)

In [22]:
results = cursor.execute("SELECT * FROM score1 WHERE student_id between 107 and 119")
for row in results:
    print(row)

('Male', 107, 66)
('Male', 108, 66)
('Male', 109, 66)
('Male', 110, 66)
('Female', 111, 66)
('Female', 112, 66)
('Female', 113, 66)
('Female', 114, 66)
('Female', 115, 66)
('Female', 116, 66)
('Female', 117, 66)
('Female', 118, 66)
('Male', 119, 66)

In [23]:
#MAX and MIN
result = cursor.execute("SELECT MIN(marks) FROM score1")
print("MINIMUM Marks = ",results.fetchone())

#MAX
result = cursor.execute("SELECT MAX(marks) FROM score1")
print("MAXIMUM Marks = ",results.fetchone())

MINIMUM Marks =  (14,)
MAXIMUM Marks =  (96,)

In [28]:
#SUBQUERY
db=sqlite3.connect("student_course_database1.db")

In [29]:
cur=db.cursor()

In [30]:
 cur.execute("create table course1(courseid int primary key, coursename text, duration int)")

In [31]:
cur.execute("create table student1(roll_no int primary key,studentname text,age int,courseid int,foreign key(courseid) references course1(courseid))")

In [32]:
cur.execute("insert into course1 values(78,'Data Science',12),(56,'python course',4),(101,'Data Base',7)")
print(cur.rowcount,"records inserted")
db.commit;

3 records inserted

In [33]:
cur.execute("insert into student1 values(1,'Jack',22,78),(2,'John',21,56),(3,'Rudolf',18,78),(4,'Jim',21,56)")
print(cur.rowcount,"records inserted")
db.commit;

4 records inserted

In [34]:
results=cur.execute('select* from student1')
results.fetchall()

[(1, 'Jack', 22, 78),
 (2, 'John', 21, 56),
 (3, 'Rudolf', 18, 78),
 (4, 'Jim', 21, 56)]

In [38]:
results=cur.execute('select* from course1')
results.fetchall()

[(78, 'Data Science', 12), (56, 'python course', 4), (101, 'Data Base', 7)]

In [36]:
results=cur.execute('select courseid from course1 where coursename="Data Science"')
for i in results:
    print(i)

(78,)

In [37]:
results=cur.execute('select * from student1 where courseid=(select courseid from course1 where coursename="Data Science")')
results.fetchall()

[(1, 'Jack', 22, 78), (3, 'Rudolf', 18, 78)]

In [39]:
results=cur.execute('select * from student1 where courseid=(select courseid from course1 where coursename="python course")')
results.fetchall()

[(2, 'John', 21, 56), (4, 'Jim', 21, 56)]

In [40]:
#JOIN
#create new table
cursor.execute("create table students (student_name TEXT, student_id INT PRIMARY KEY,phone_number INT)")
cursor.execute("insert into students (student_name,student_id,phone_number) VALUES('sachin',105,4555545555),('virat',113,6644949),('rohith',100,64646449949),('sindhu',106,64646464),('usha',102,464646468441)")
db.commit()
results=cursor.execute("select * from students")
print('Name   Stud_ID   Phone_Num \n')
for row in results:
    print(row)

Name   Stud_ID   Phone_Num

('sachin', 105, 4555545555)
('virat', 113, 6644949)
('rohith', 100, 64646449949)
('sindhu', 106, 64646464)
('usha', 102, 464646468441)

In [41]:
results = cursor.execute("SELECT * FROM score1")
for row in results:
    print(row)

('Male', 100, 55)
('Female', 101, 60)
('Female', 102, 68)
('Female', 103, 60)
('Female', 105, 14)
('Male', 106, 25)
('Male', 107, 66)
('Male', 108, 66)
('Male', 109, 66)
('Male', 110, 66)
('Female', 111, 66)
('Female', 112, 66)
('Female', 113, 66)
('Female', 114, 66)
('Female', 115, 66)
('Female', 116, 66)
('Female', 117, 66)
('Female', 118, 66)
('Male', 119, 66)
('Male', 120, 96)
('Female', 121, 78)

In [42]:
#INNER JOIN
sql = "select students.student_id, students.student_name,score1.gender,score1.marks FROM score1 INNER JOIN students ON students.student_id = score1.student_id"
results = cursor.execute(sql)
for row in result:
    print(row)

(100, 'rohith', 'Male', 55)
(102, 'usha', 'Female', 68)
(105, 'sachin', 'Female', 14)
(106, 'sindhu', 'Male', 25)
(113, 'virat', 'Female', 66)

In [43]:
#left join
sql = "select students.student_id, students.student_name,score1.gender,score1.marks FROM score1 LEFT JOIN students ON students.student_id = score1.student_id"
results = cursor.execute(sql)
for row in result:
    print(row)

(100, 'rohith', 'Male', 55)
(None, None, 'Female', 60)
(102, 'usha', 'Female', 68)
(None, None, 'Female', 60)
(105, 'sachin', 'Female', 14)
(106, 'sindhu', 'Male', 25)
(None, None, 'Male', 66)
(None, None, 'Male', 66)
(None, None, 'Male', 66)
(None, None, 'Male', 66)
(None, None, 'Female', 66)
(None, None, 'Female', 66)
(113, 'virat', 'Female', 66)
(None, None, 'Female', 66)
(None, None, 'Female', 66)
(None, None, 'Female', 66)
(None, None, 'Female', 66)
(None, None, 'Female', 66)
(None, None, 'Male', 66)
(None, None, 'Male', 96)
(None, None, 'Female', 78)

In [44]:
sql = "DROP TABLE score1"
cursor.execute(sql)

In [45]:
sql = "DROP TABLE students"
cursor.execute(sql)

In [46]:
db.close()

In [47]:
results = cursor.execute("SELECT * FROM score1")
for row in results:
    print(row)

OperationalError: no such table: score1